#+TITLE: Leetcode-array
#+DATE: <2017-07-16 Sun> 
#+LAYOUT: post
#+TAGS: leetcode
#+CATEGORIES: 技术积累
#+STARTUP: content

  #+NAME: interval-def
  #+BEGIN_SRC go
    type Interval struct {
     Start int
     End   int
    }
  #+END_SRC

* pascal's triangle
  :PROPERTIES:
  :ID:       955a32cc-ff35-432c-87da-c1173739bd61
  :END:
  #+NAME: pascal-triangle-generate
  #+BEGIN_SRC go
    func generate(numRows int) [][]int {
      pt_arr := make([][]int, 0)
      if numRows < 1 {
        return pt_arr
      }
      pt_arr = append(pt_arr, []int{1})
      if numRows == 1 {
        return pt_arr
      }
      pt_arr = append(pt_arr, []int{1, 1})
      if numRows < 3 {
        return pt_arr
      }
      for i := 3; i <= numRows; i += 1 {
        pt := make([]int, i)
        pre_pt := pt_arr[i-2]
        var pre int
        for index, _ := range pre_pt {
          if index == 0 {
            pt[index] = pre_pt[index]
            pre = pre_pt[index]
            continue
          }

          if index == len(pre_pt)-1 {
            pt[index] = pre + pre_pt[index]
            pt[index+1] = pre_pt[index]
            continue
          }

          pt[index] = pre + pre_pt[index]
          pre = pre_pt[index]
        }
        pt_arr = append(pt_arr, pt)
      }

      return pt_arr
    }
  #+END_SRC

  #+BEGIN_SRC go :imports "fmt" :noweb strip-export
    <<pascal-triangle-generate>>

    func main() {
        fmt.Println(generate(3))
    }
  #+END_SRC

  #+RESULTS:
  : [[1] [1 1] [1 2 1]]

* pascal's triangle II
  :PROPERTIES:
  :ID:       f2b7b1c8-839c-4976-96d1-e95394e59b64
  :END:
  #+NAME: pascal-triangle-getrow
  #+BEGIN_SRC go
    func getRow(rowIndex int) []int {
      rowIndex += 1
      pt_row := make([]int, rowIndex)
      if rowIndex < 1 {
        return pt_row
      }
      pt_row[0] = 1
      if rowIndex == 1 {
        return pt_row
      }
      pt_row[1] = 1

      for i := 3; i <= rowIndex; i += 1 {
        ptr := pt_row[0:i]
        pre_ptr := pt_row[0 : i-1]
        var pre int
        for index, _ := range pre_ptr {
          if index == 0 {
            pre = pre_ptr[index]
            continue
          }

          if index == len(pre_ptr)-1 {
            ptr[index+1] = pre_ptr[index]
            ptr[index] = pre + pre_ptr[index]
            continue
          }

          pre_num := pre_ptr[index]
          ptr[index], pre = pre+pre_num, pre_num
        }
      }

      return pt_row
    }
  #+END_SRC

  #+BEGIN_SRC go :imports "fmt" :noweb strip-export
    <<pascal-triangle-getrow>>

    func main() {
        fmt.Println(getRow(4))
    }
  #+END_SRC

  #+RESULTS:
  : [1 3 3 1]
* move zeroes
  :PROPERTIES:
  :ID:       818861d8-8ca1-4f72-b7ac-0043b0c6a443
  :END:
  #+NAME: move-zeroes
  #+BEGIN_SRC go
    func moveZeroes(nums []int) {
      for index, num := range nums {
        if num == 0 {
          continue
        }

        for j := index; 0 < j; j -= 1 {
          if nums[j-1] == 0 {
            nums[j-1], nums[j] = nums[j], nums[j-1]
          } else {
            break
          }
        }
      }

      return
    }
  #+END_SRC

  #+BEGIN_SRC go :imports "fmt" :noweb strip-export
    <<move-zeroes>>

    func main() {
      nums := []int{0, 1, 0, 3, 12}
      moveZeroes(nums)
      fmt.Println(nums)
    }
  #+END_SRC

  #+RESULTS:
  : [1 3 12 0 0]
* DONE maximum subarray
  CLOSED: [2017-07-18 Tue 23:30] SCHEDULED: <2017-07-18 Tue 21:30>
  :PROPERTIES:
  :ID:       89cea991-3745-4b96-a8ef-9f65b8655e29
  :Effort:   15:00
  :END:
  - State "DONE"       from "WAITING"    [2017-07-18 Tue 23:30]
  :LOGBOOK:
  CLOCK: [2017-07-18 Tue 23:20]--[2017-07-18 Tue 23:30] =>  0:10
  :END:
  #+BEGIN_SRC go
    func maxSubArray(nums []int) int {
      if len(nums) < 1 {
        return 0
      }

      size := len(nums)
      max_sum := nums[0]
      pre_sum := nums[0]
      for i := 1; i < size; i += 1 {
        if pre_sum > 0 {
          pre_sum = nums[i] + pre_sum
        } else {
          pre_sum = nums[i]
        }
        if pre_sum > max_sum {
          max_sum = pre_sum
        }
      }

      return max_sum
    }
  #+END_SRC
* rotate array
  :PROPERTIES:
  :ID:       01baaeb2-7713-4dd7-bcc2-999218245060
  :END:
  #+NAME: rotate-array
  #+BEGIN_SRC go
    func reverse(nums []int) {
      size := len(nums)
      mid := size / 2
      for i := 0; i < mid; i += 1 {
        nums[i], nums[size-i-1] = nums[size-i-1], nums[i]
      }
    }

    func rotate(nums []int, k int) {
      size := len(nums)
      if size == 1 {
        return
      }
      k = k % size
      reverse(nums[0 : size-k])
      reverse(nums[size-k : size])
      reverse(nums)
    }
  #+END_SRC

  #+BEGIN_SRC go :imports "fmt" :noweb strip-export
        <<rotate-array>>

        func main() {
          arr := []int{1,2,3,4,5,6,7}
          rotate(arr, 3)
          fmt.Println(arr)
        }
  #+END_SRC

  #+RESULTS:
  : [5 6 7 1 2 3 4]
* maximum product subarray
  :PROPERTIES:
  :ID:       94010a20-a154-495e-a24f-314453110e67
  :END:
  #+NAME: maximum-product-subarray
  #+BEGIN_SRC go
    func max(a, b int) int {
      if a > b {
        return a
      } else {
        return b
      }
    }

    func min(a, b int) int {
      if a > b {
        return b
      } else {
        return a
      }
    }

    func maxProduct(nums []int) int {
      if len(nums) < 1 {
        return 0
      }

      size := len(nums)
      maxp_sub_arr := make([]int, size)
      ng_maxp_sub_arr := make([]int, size)
      maxp_sub_arr[0] = nums[0]
      if maxp_sub_arr[0] < 0 {
        ng_maxp_sub_arr[0] = maxp_sub_arr[0]
      } else {
        ng_maxp_sub_arr[0] = 1
      }
      for i := 1; i < size; i += 1 {
        if nums[i] == 0 {
          continue
        }

        if maxp_sub_arr[i-1] == 0 {
          maxp_sub_arr[i] = nums[i]
          if nums[i] < 0 {
            ng_maxp_sub_arr[i] = maxp_sub_arr[i]
          } else {
            ng_maxp_sub_arr[i] = 1
          }
        }

        if nums[i] > 0 {
          maxp_sub_arr[i] = max(nums[i]*maxp_sub_arr[i-1], nums[i])
          ng_maxp_sub_arr[i] = nums[i] * ng_maxp_sub_arr[i-1]
        }

        if nums[i] < 0 {
          maxp_sub_arr[i] = nums[i] * ng_maxp_sub_arr[i-1]
          ng_maxp_sub_arr[i] = min(nums[i]*maxp_sub_arr[i-1], nums[i])
        }
      }

      maxp := maxp_sub_arr[0]
      for _, subp := range maxp_sub_arr {
        if subp > maxp {
          maxp = subp
        }
      }

      return maxp
    }
  #+END_SRC

  #+BEGIN_SRC go :imports "fmt" :noweb strip-export
        <<maximum-product-subarray>>

        func main() {
          fmt.Println(maxProduct([]int{2,3,-2,4,0,-3,-4}))
        }
  #+END_SRC

  #+RESULTS:
  : 12
* minimum size subarray sum
  :PROPERTIES:
  :ID:       ae8200c6-b764-479c-9f7c-a3faee06c76c
  :END:
  #+NAME: minimum-size-subarray-sum
  #+BEGIN_SRC go
    func minSubArrayLen(s int, nums []int) int {
      if len(nums) < 0 {
        return 0
      }

      var sub_sum, msub_arl, sub_arl int
      size := len(nums)
      msub_arl = size + 1
      for index, num := range nums {
        if sub_sum+num < s {
          sub_sum += num
          sub_arl += 1
          continue
        }

        if sub_sum+num >= s {
          for {
            if sub_arl < 1 {
              break
            }

            del_num := nums[index-sub_arl]
            sub_sum -= del_num
            sub_arl -= 1
            if sub_sum+num < s {
              sub_sum += num
              sub_arl += 1
              break
            }
          }

          if sub_arl+1 < msub_arl {
            msub_arl = sub_arl + 1
          }
        }
      }

      if msub_arl == size+1 {
        msub_arl = 0
      }

      return msub_arl
    }
  #+END_SRC

  #+BEGIN_SRC go :imports "fmt" :noweb strip-export
    <<minimum-size-subarray-sum>>

    func main() {
      fmt.Println(minSubArrayLen(15, []int{5,1,3,5,10,7,4,9,2,8}))
    }
  #+END_SRC

  #+RESULTS:
  : 1
* array nesting
  :PROPERTIES:
  :ID:       5054147d-6967-4087-9995-3d0b99934c1c
  :END:
  #+NAME: array-nesting
  #+BEGIN_SRC go
    func arrayNesting(nums []int) int {
      anl_arr := make([]int, len(nums))

      var max_anl int
      for _, num := range nums {
        if anl_arr[num] > 0 {
          continue
        }

        var anl int
        next_num := num
        for {
          anl_arr[next_num] = 1
          anl += 1

          next_num = nums[next_num]
          if next_num == num {
            break
          }
        }

        if anl > max_anl {
          max_anl = anl
        }
      }

      return max_anl
    }
  #+END_SRC

  #+BEGIN_SRC go :imports "fmt" :noweb strip-export
    <<array-nesting>>

    func main() {
      fmt.Println(arrayNesting([]int{5,4,0,3,1,6,2}))
    }
  #+END_SRC

  #+RESULTS:
  : 4
